# RebarSystemLayerSummaryTopDir1WithSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemLayerSummaryTopDir1WithSpacing Property
ParameterTypeId Class See Also
---
"Top/Exterior Major"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemLayerSummaryTopDir1WithSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemLayerSummaryTopDir1WithSpacing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemLayerSummaryTopDir1WithSpacing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace